MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX270F256B.atdf
         <register caption="" name="PRId" offset="0xa8" rw="R" size="4">
            <bitfield mask="0x00000003" name="Patch" />
            <bitfield mask="0x0000001C" name="MINrev" />
            <bitfield mask="0x000000E0" name="MAJrev" />
            <bitfield mask="0x0000FF00" name="PrID" />
            <bitfield mask="0x00FF0000" name="CoID" />
         </register>
         <register caption="" name="EBASE" offset="0xac" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="CPUNum" />
            <bitfield mask="0x3FFFF000" name="ExBase" />
         </register>
         <register caption="" name="Config" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000007" name="K0" />
            <bitfield mask="0x00000380" name="MT" />
            <bitfield mask="0x00001C00" name="AR" />
            <bitfield mask="0x00006000" name="AT" />
            <bitfield mask="0x00008000" name="BE" />
            <bitfield mask="0x00010000" name="DS" />
            <bitfield mask="0x00100000" name="MDU" />
            <bitfield mask="0x00200000" name="SB" />
            <bitfield mask="0x00400000" name="UDI" />
            <bitfield mask="0x0E000000" name="KU" />
            <bitfield mask="0x70000000" name="K23" />
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Config1" offset="0xb4" rw="R" size="4">
            <bitfield mask="0x00000001" name="FP" />
            <bitfield mask="0x00000002" name="EP" />
            <bitfield mask="0x00000004" name="CA" />
            <bitfield mask="0x00000008" name="WR" />
            <bitfield mask="0x00000010" name="PC" />
            <bitfield mask="0x00000020" name="MD" />
            <bitfield mask="0x00000040" name="C2" />
            <bitfield mask="0x00000380" name="DA" />
            <bitfield mask="0x00001C00" name="DL" />
            <bitfield mask="0x0000E000" name="DS" />
            <bitfield mask="0x00070000" name="IA" />
            <bitfield mask="0x00380000" name="IL" />
            <bitfield mask="0x01C00000" name="IS" />
            <bitfield mask="0x7E000000" name="MMUsz" />
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Config2" offset="0xb8" rw="R" size="4">
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Config3" offset="0xbc" rw="R" size="4">
            <bitfield mask="0x00000001" name="TL" />
            <bitfield mask="0x00000002" name="SM" />
            <bitfield mask="0x00000010" name="SP" />
            <bitfield mask="0x00000020" name="VInt" />
            <bitfield mask="0x00000040" name="VEIC" />
            <bitfield mask="0x00000100" name="ITL" />
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Debug" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="DSS" />
            <bitfield mask="0x00000002" name="DBp" />
            <bitfield mask="0x00000004" name="DDBL" />
            <bitfield mask="0x00000008" name="DDBS" />
            <bitfield mask="0x00000010" name="DIB" />
            <bitfield mask="0x00000020" name="DINT" />
            <bitfield mask="0x000000C0" name="R" />
            <bitfield mask="0x00000100" name="SSt" />
            <bitfield mask="0x00000200" name="NoSST" />
            <bitfield mask="0x00007C00" name="DExcCode" />
            <bitfield mask="0x00038000" name="Ver" />
            <bitfield mask="0x00040000" name="DDBLImpr" />
            <bitfield mask="0x00080000" name="DDBSImpr" />
            <bitfield mask="0x00100000" name="IEXI" />
            <bitfield mask="0x00200000" name="DBusEP" />
            <bitfield mask="0x00400000" name="CacheEP" />
            <bitfield mask="0x00800000" name="MCheckP" />
            <bitfield mask="0x01000000" name="IBusEP" />
            <bitfield mask="0x02000000" name="CountDM" />
            <bitfield mask="0x04000000" name="Halt" />
            <bitfield mask="0x08000000" name="Doze" />
            <bitfield mask="0x10000000" name="LSNM" />
            <bitfield mask="0x20000000" name="NoDCR" />
            <bitfield mask="0x40000000" name="DM" />
            <bitfield mask="0x80000000" name="DBD" />
         </register>
         <register caption="" name="TraceControl" offset="0xc4" rw="RW" size="4">
            <bitfield mask="0x00000001" name="On" />
            <bitfield mask="0x0000000E" name="Mode" />
            <bitfield mask="0x00000010" name="G" />
            <bitfield mask="0x00001FE0" name="ASID" />
            <bitfield mask="0x001FE000" name="ASID_M" />
            <bitfield mask="0x00200000" name="U" />
            <bitfield mask="0x00400000" name="S" />
            <bitfield mask="0x00800000" name="K" />
            <bitfield mask="0x01000000" name="E" />
            <bitfield mask="0x02000000" name="D" />
            <bitfield mask="0x04000000" name="IO" />
            <bitfield mask="0x08000000" name="TB" />
            <bitfield mask="0x40000000" name="UT" />
            <bitfield mask="0x80000000" name="TS" />
         </register>
         <register caption="" name="TraceControl2" offset="0xc8" rw="R" size="4">
            <bitfield mask="0x00000007" name="SyP" />
            <bitfield mask="0x00000008" name="TBU" />
            <bitfield mask="0x00000010" name="TBI" />
            <bitfield mask="0x00000060" name="ValidModes" />
         </register>
         <register caption="" name="UserTraceData" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Data" />
         </register>
         <register caption="" name="TraceBPC" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IBPOn" />
            <bitfield mask="0x00008000" name="IE" />
            <bitfield mask="0x00030000" name="DBPOn" />
            <bitfield mask="0x80000000" name="DE" />
         </register>
         <register caption="" name="Debug2" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="debug2" />
         </register>
         <register caption="" name="DEPC" offset="0xd8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DEPC" />
         </register>
         <register caption="" name="ErrorEPC" offset="0xdc" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ErrorEPC" />
         </register>
         <register caption="" name="DESAVE" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DESAVE" />
         </register>
         <register caption="" name="lo" offset="0xe4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUlow" />
         </register>
         <register caption="" name="hi" offset="0xe8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUhigh" />
         </register>
      </register-group>
   </module>
   <module caption="" id="01461" name="CTMU" version="1">
      <register-group name="CTMU">
         <register caption="CTMU Control Register" name="CTMUCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Current Range Select bits" mask="0x00000003" name="IRNG" values="CTMUCON__IRNG" />
            <bitfield caption="Current Source Trim bits" mask="0x000000FC" name="ITRIM" values="CTMUCON__ITRIM" />
            <bitfield caption="Trigger Control bit" mask="0x00000100" name="CTTRIG" values="CTMUCON__CTTRIG" />
            <bitfield caption="Analog Current Source Control bit" mask="0x00000200" name="IDISSEN" values="CTMUCON__IDISSEN" />
            <bitfield caption="Edge Sequence Enable bit" mask="0x00000400" name="EDGSEQEN" values="CTMUCON__EDGSEQEN" />
            <bitfield caption="Edge Enable bit" mask="0x00000800" name="EDGEN" values="CTMUCON__EDGEN" />
            <bitfield caption="Time Generation Enable bit" mask="0x00001000" name="TGEN" values="CTMUCON__TGEN" />
            <bitfield caption="Stop-in-Idle Mode bit" mask="0x00002000" name="CTMUSIDL" values="CTMUCON__CTMUSIDL" />
            <bitfield caption="ON Enable bit" mask="0x00008000" name="ON" values="CTMUCON__ON" />
            <bitfield caption="Edge 2 Source Select bits" mask="0x003C0000" name="EDG2SEL" values="CTMUCON__EDG2SEL" />
            <bitfield caption="Edge 2 Polarity Select bit" mask="0x00400000" name="EDG2POL" values="CTMUCON__EDG2POL" />
            <bitfield caption="Edge2 Edge Sampling Select bit" mask="0x00800000" name="EDG2MOD" values="CTMUCON__EDG2MOD" />
            <bitfield caption="Edge1 Status bit" mask="0x01000000" name="EDG1STAT" values="CTMUCON__EDG1STAT" />
            <bitfield caption="Edge2 Status bit" mask="0x02000000" name="EDG2STAT" values="CTMUCON__EDG2STAT" />
            <bitfield caption="Edge 1 Source Select bits" mask="0x3C000000" name="EDG1SEL" values="CTMUCON__EDG1SEL" />
            <bitfield caption="Edge 1 Polarity Select bit" mask="0x40000000" name="EDG1POL" values="CTMUCON__EDG1POL" />
            <bitfield caption="Edge1 Edge Sampling Select bit" mask="0x80000000" name="EDG1MOD" values="CTMUCON__EDG1MOD" />
         </register>
      </register-group>
      <value-group caption="Current Range Select bits" name="CTMUCON__IRNG">
         <value caption="100 times base current" name="" value="0x3" />
         <value caption="10 times base current" name="" value="0x2" />
         <value caption="Base current level" name="" value="0x1" />
         <value caption="1000 times base current" name="" value="0x0" />
      </value-group>
      <value-group caption="Current Source Trim bits" name="CTMUCON__ITRIM">
         <value caption="Maximum positive change from nominal current" name="" value="0x1f" />
         <value caption="Minimum positive change from nominal current" name="" value="0x1" />
         <value caption="Nominal current output specified by IRNG(1:0)" name="" value="0x0" />
         <value caption="Minimum negative change from nominal current" name="" value="0x3f" />
         <value caption="Maximum negative change from nominal current" name="" value="0x21" />
      </value-group>
      <value-group caption="Trigger Control bit" name="CTMUCON__CTTRIG">
         <value caption="Trigger output is enabled" name="" value="0x1" />
         <value caption="Trigger output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Current Source Control bit" name="CTMUCON__IDISSEN">
         <value caption="Analog current source output is grounded" name="" value="0x1" />
         <value caption="Analog current source output is not grounded" name="" value="0x0" />
      </value-group>
