MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX270F256B.atdf
         <register caption="Type B Timer Control Register" name="T5CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T5CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T5CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T5CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T5CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T5CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T5CON__ON" />
         </register>
         <register caption="" name="TMR2" offset="0x10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR2" />
         </register>
         <register caption="" name="TMR3" offset="0x210" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR3" />
         </register>
         <register caption="" name="TMR4" offset="0x410" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR4" />
         </register>
         <register caption="" name="TMR5" offset="0x610" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR5" />
         </register>
         <register caption="" name="PR2" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR2" />
         </register>
         <register caption="" name="PR3" offset="0x220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR3" />
         </register>
         <register caption="" name="PR4" offset="0x420" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR4" />
         </register>
         <register caption="" name="PR5" offset="0x620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR5" />
         </register>
      </register-group>
      <value-group caption="Timer Clock Source Select bit" name="T2CON__TCS">
         <value caption="External clock from TxCK pin" name="" value="0x1" />
         <value caption="Internal peripheral clock" name="" value="0x0" />
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T2CON__T32">
         <value caption="Odd numbered and even numbered timers form a 32-bit timer" name="" value="0x1" />
         <value caption="Odd numbered and even numbered timers form a separate 16-bit timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T2CON__TCKPS">
         <value caption="1:256 prescale value" name="" value="0x7" />
         <value caption="1:64 prescale value" name="" value="0x6" />
         <value caption="1:32 prescale value" name="" value="0x5" />
         <value caption="1:16 prescale value" name="" value="0x4" />
         <value caption="1:8 prescale value" name="" value="0x3" />
         <value caption="1:4 prescale value" name="" value="0x2" />
         <value caption="1:2 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T2CON__TGATE">
         <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is enabled" name="" value="0x1" />
         <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T2CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T2CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Clock Source Select bit" name="T3CON__TCS">
         <value caption="External clock from TxCK pin" name="" value="0x1" />
         <value caption="Internal peripheral clock" name="" value="0x0" />
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T3CON__T32">
         <value caption="Odd numbered and even numbered timers form a 32-bit timer" name="" value="0x1" />
         <value caption="Odd numbered and even numbered timers form a separate 16-bit timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T3CON__TCKPS">
         <value caption="1:256 prescale value" name="" value="0x7" />
         <value caption="1:64 prescale value" name="" value="0x6" />
         <value caption="1:32 prescale value" name="" value="0x5" />
         <value caption="1:16 prescale value" name="" value="0x4" />
         <value caption="1:8 prescale value" name="" value="0x3" />
         <value caption="1:4 prescale value" name="" value="0x2" />
         <value caption="1:2 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T3CON__TGATE">
         <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is enabled" name="" value="0x1" />
         <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T3CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T3CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Clock Source Select bit" name="T4CON__TCS">
         <value caption="External clock from TxCK pin" name="" value="0x1" />
         <value caption="Internal peripheral clock" name="" value="0x0" />
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T4CON__T32">
         <value caption="Odd numbered and even numbered timers form a 32-bit timer" name="" value="0x1" />
         <value caption="Odd numbered and even numbered timers form a separate 16-bit timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T4CON__TCKPS">
         <value caption="1:256 prescale value" name="" value="0x7" />
         <value caption="1:64 prescale value" name="" value="0x6" />
         <value caption="1:32 prescale value" name="" value="0x5" />
         <value caption="1:16 prescale value" name="" value="0x4" />
         <value caption="1:8 prescale value" name="" value="0x3" />
         <value caption="1:4 prescale value" name="" value="0x2" />
         <value caption="1:2 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T4CON__TGATE">
         <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is enabled" name="" value="0x1" />
         <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T4CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T4CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Clock Source Select bit" name="T5CON__TCS">
         <value caption="External clock from TxCK pin" name="" value="0x1" />
         <value caption="Internal peripheral clock" name="" value="0x0" />
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T5CON__T32">
         <value caption="Odd numbered and even numbered timers form a 32-bit timer" name="" value="0x1" />
         <value caption="Odd numbered and even numbered timers form a separate 16-bit timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T5CON__TCKPS">
         <value caption="1:256 prescale value" name="" value="0x7" />
         <value caption="1:64 prescale value" name="" value="0x6" />
         <value caption="1:32 prescale value" name="" value="0x5" />
         <value caption="1:16 prescale value" name="" value="0x4" />
         <value caption="1:8 prescale value" name="" value="0x3" />
         <value caption="1:4 prescale value" name="" value="0x2" />
         <value caption="1:2 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T5CON__TGATE">
         <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is enabled" name="" value="0x1" />
         <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T5CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="" value="0x0" />
      </value-group>
