MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX270F256B.atdf
      <value-group caption="Receive Buffer Data Available bit (read-only)" name="U2STA__URXDA">
         <value caption="Receive buffer has data, at least one more character can be read" name="" value="0x1" />
         <value caption="Receive buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Overrun Error Status bit" name="U2STA__OERR">
         <value caption="Receive buffer has overflowed" name="" value="0x1" />
         <value caption="Receive buffer has not overflowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Framing Error Status bit (read-only)" name="U2STA__FERR">
         <value caption="Framing error has been detected for the current character" name="" value="0x1" />
         <value caption="Framing error has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Parity Error Status bit (read-only)" name="U2STA__PERR">
         <value caption="Parity error has been detected for the current character" name="" value="0x1" />
         <value caption="Parity error has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Idle bit (read-only)" name="U2STA__RIDLE">
         <value caption="Receiver is Idle" name="" value="0x1" />
         <value caption="Data is being received" name="" value="0x0" />
      </value-group>
      <value-group caption="Address Character Detect bit (bit 8 of received data = 1)" name="U2STA__ADDEN">
         <value caption="Address Detect mode is enabled. If 9-bit mode is not selected" name="" value="0x1" />
         <value caption="Address Detect mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Interrupt Mode Selection bit" name="U2STA__URXISEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt flag bit is asserted while receive buffer is 3/4 or more full" name="" value="0x2" />
         <value caption="Interrupt flag bit is asserted while receive buffer is 1/2 or more full" name="" value="0x1" />
         <value caption="Interrupt flag bit is asserted while receive buffer is not empty (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Shift Register is Empty bit (read-only)" name="U2STA__TRMT">
         <value caption="Transmit shift register is empty and transmit buffer is empty (the last transmission has completed)" name="" value="0x1" />
         <value caption="Transmit shift register is not empty, a transmission is in progress or queued in the transmit buffer" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit" name="U2STA__UTXBF">
         <value caption="Transmit buffer is full" name="" value="0x1" />
         <value caption="Transmit buffer is not full, at least one more character can be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Enable bit" name="U2STA__UTXEN">
         <value caption="UARTx transmitter is enabled. UxTX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx transmitter is disabled. Any pending transmission is aborted and buffer is reset. UxTX pin is controlled by the port." name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Break bit" name="U2STA__UTXBRK">
         <value caption="Send Break on next transmission. Start bit followed by twelve 0 bits, followed by Stop bit; cleared by hardware upon completion" name="" value="0x1" />
         <value caption="Break transmission is disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Enable bit" name="U2STA__URXEN">
         <value caption="UARTx receiver is enabled. UxRX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx receiver is disabled. UxRX pin is ignored by the UARTx module. UxRX pin is controlled by the port." name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Polarity Inversion bit" name="U2STA__UTXINV">
         <value caption="(If IrDA mode is disabled) UxTX Idle state is 0 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 1" name="" value="0x1" />
         <value caption="(If IrDA mode is disabled) UxTX Idle state is 1 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Interrupt Mode Selection bits" name="U2STA__UTXISEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt is generated and asserted while the transmit buffer is empty" name="" value="0x2" />
         <value caption="Interrupt is generated and asserted when all characters have been transmitted" name="" value="0x1" />
         <value caption="Interrupt is generated and asserted while the transmit buffer contains at least one empty space" name="" value="0x0" />
      </value-group>
      <value-group caption="Automatic Address Detect Mode Enable bit" name="U2STA__ADM_EN">
         <value caption="Automatic Address Detect mode is enabled" name="" value="0x1" />
         <value caption="Automatic Address Detect mode is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01195" name="USB" version="2">
      <register-group name="USB">
         <register caption="USB OTG Interrupt Status Register" name="U1OTGIR" offset="0x0" rw="RW" size="4">
            <bitfield caption="A-Device Vbus Change Indicator bit" mask="0x00000001" name="VBUSVDIF" values="U1OTGIR__VBUSVDIF" />
            <bitfield caption="B-Device Vbus Change Indicator bit" mask="0x00000004" name="SESENDIF" values="U1OTGIR__SESENDIF" />
            <bitfield caption="Session Valid Change Indicator bit" mask="0x00000008" name="SESVDIF" values="U1OTGIR__SESVDIF" />
            <bitfield caption="Bus Activity Indicator bit" mask="0x00000010" name="ACTVIF" values="U1OTGIR__ACTVIF" />
            <bitfield caption="Line State Stable Indicator bit" mask="0x00000020" name="LSTATEIF" values="U1OTGIR__LSTATEIF" />
            <bitfield caption="1 Millisecond Timer bit" mask="0x00000040" name="T1MSECIF" values="U1OTGIR__T1MSECIF" />
            <bitfield caption="ID State Change Indicator bit" mask="0x00000080" name="IDIF" values="U1OTGIR__IDIF" />
         </register>
